package clock;

import java.io.IOException;
import java.util.Date;

public class HangulClock {

    String[][] hours = {{"열", "두2"}, {"한"}, {"두"}, {"세"}, {"네"}, {"다", "섯"}, {"여", "섯2"}, {"일", "곱"}, {"여2", "덟"}, {"아", "홉"}, {"열"},
            {"열", "한2"}, {"열", "두2"}};
    String[][] minutes = {{""}, {"일2"}, {"이2"}, {"삼2"}, {"사2"}, {"오3"}, {"육"}, {"칠"}, {"팔"}, {"구"}, {"십"}, {"십", "일2"}, {"십", "이2"},
            {"십", "삼2"}, {"십", "사2"}, {"십", "오3"}, {"십", "육"}, {"십", "칠"}, {"십", "팔"}, {"십", "구"}, {"이", "십"}, {"이", "십", "일2"},
            {"이", "십", "이2"}, {"이", "십", "삼2"}, {"이", "십", "사2"}, {"이", "십", "오3"}, {"이", "십", "육"}, {"이", "십", "칠"},
            {"이", "십", "팔"}, {"이", "십", "구"}, {"삼", "십"}, {"삼", "십", "일2"}, {"삼", "십", "이2"}, {"삼", "십", "삼2"}, {"삼", "십", "사2"},
            {"삼", "십", "오3"}, {"삼", "십", "육"}, {"삼", "십", "칠"}, {"삼", "십", "팔"}, {"삼", "십", "구"}, {"사", "십"}, {"사", "십", "일2"},
            {"사", "십", "이2"}, {"사", "십", "삼2"}, {"사", "십", "사2"}, {"사", "십", "오3"}, {"사", "십", "육"}, {"사", "십", "칠"},
            {"사", "십", "팔"}, {"사", "십", "구"}, {"오", "십"}, {"오", "십", "일2"}, {"오", "십", "이2"}, {"오", "십", "삼2"}, {"오", "십", "사2"},
            {"오", "십", "오3"}, {"오", "십", "육"}, {"오", "십", "칠"}, {"오", "십", "팔"}, {"오", "십", "구"}};
    String[][] noons = {{"자", "정"}, {"정", "오1"}};
    
    public static void main(String[] args) {
        final Date date = new Date();

        while (true) {
            try {
                clearScreen();
                printScreen(date);
                Thread.sleep(6000);

            } catch (InterruptedException e) {
                e.printStackTrace();
            }
        }
    }

    private static void printScreen(Date date) {
        date.setTime(System.currentTimeMillis());
        System.out.println(date);
    }

    public static void clearScreen() {
        System.out.print("\033[H\033[2J");
        System.out.flush();
    }
    
}
